nicksean/sms_forwarding/sdkconfig.defaults
# ESP32-C3 native ESP-IDF defaults for the SMS forwarder port.
# Keep generated sdkconfig under build/ by invoking idf.py with:
#   idf.py -B build/idf -D "SDKCONFIG=build/sdkconfig" set-target esp32c3 build

CONFIG_IDF_TARGET="esp32c3"
CONFIG_ESPTOOLPY_FLASHSIZE_4MB=y
CONFIG_PARTITION_TABLE_CUSTOM=y
CONFIG_PARTITION_TABLE_CUSTOM_FILENAME="partitions_ota_1m9.csv"
CONFIG_PARTITION_TABLE_FILENAME="partitions_ota_1m9.csv"
CONFIG_PARTITION_TABLE_OFFSET=0x8000
CONFIG_ESP_MAIN_TASK_STACK_SIZE=8192
CONFIG_ESP_SYSTEM_EVENT_TASK_STACK_SIZE=4096
CONFIG_FREERTOS_HZ=1000
CONFIG_BT_ENABLED=n

# ---- Flash 体积 ----
# -Os 尺寸优化(默认 -Og 调试档，是最大的单项体积杠杆)
CONFIG_COMPILER_OPTIMIZATION_SIZE=y
# 断言保留但不打印文件名/行号字符串(省 rodata)
CONFIG_COMPILER_OPTIMIZATION_ASSERTIONS_SILENT=y
# 证书包用常用 CA 子集(覆盖 Let's Encrypt/DigiCert 等主流 CA，比完整包省 ~50KB+)
CONFIG_MBEDTLS_CERTIFICATE_BUNDLE_DEFAULT_CMN=y
# 本固件只用 IPv4(推送/SMTP/NTP/captive DNS 均为 v4)，关 IPv6 省 flash+RAM
CONFIG_LWIP_IPV6=n
# 无终端应用，不需要 termios
CONFIG_VFS_SUPPORT_TERMIOS=n
# 代码强制 WIFI_STORAGE_RAM，WiFi 自身的 NVS 通道用不到
CONFIG_ESP_WIFI_NVS_ENABLED=n

# ---- RAM ----
# 短信转发对 WiFi 吞吐无要求，把 WiFi 收发路径移出 IRAM 释放 ~20KB 内存
CONFIG_ESP_WIFI_IRAM_OPT=n
CONFIG_ESP_WIFI_RX_IRAM_OPT=n
# FreeRTOS/环形缓冲函数放 flash，再省若干 KB IRAM
CONFIG_FREERTOS_PLACE_FUNCTIONS_INTO_FLASH=y
CONFIG_RINGBUF_PLACE_FUNCTIONS_INTO_FLASH=y
# TLS 收发缓冲按需分配、会话结束即释放(空闲期节省 ~40KB 堆；本机同时只有一条 TLS)
CONFIG_MBEDTLS_DYNAMIC_BUFFER=y
CONFIG_MBEDTLS_DYNAMIC_FREE_CONFIG_DATA=y
CONFIG_MBEDTLS_DYNAMIC_FREE_CA_CERT=y
# Web UI 为轻量单用户场景，收/发动态缓冲 32→16 降低突发内存峰值
CONFIG_ESP_WIFI_DYNAMIC_RX_BUFFER_NUM=16
CONFIG_ESP_WIFI_DYNAMIC_TX_BUFFER_NUM=16

# ---- 可靠性 ----
# NTP 主服务器 + 2 个兜底(idf_wifi 里注册)，单服务器不可达时时间同步不再瘫痪
CONFIG_LWIP_SNTP_MAX_SERVERS=3
# 分区表本来就保留了 64KB coredump 分区，启用崩溃转储，无人值守设备排障必备
CONFIG_ESP_COREDUMP_ENABLE_TO_FLASH=y
CONFIG_ESP_COREDUMP_DATA_FORMAT_ELF=y
CONFIG_ESP_COREDUMP_CHECKSUM_CRC32=y
